api/app/controllers/payments_controller.rb

  def index
    payments = Payment.order(created_at: :desc).limit(50)
    render json: payments.map { |p| PaymentSerializer.render(p) }
---
SELECT "payments".* FROM "payments" ORDER BY "payments"."created_at" DESC LIMIT $1  [["LIMIT", 50]]